Revit 2026 API

# RectangularGridSegmentOrientation Enumeration

---

The orientation type of rectangular grid segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RectangularGridSegmentOrientation
```
```vb
Public Enumeration RectangularGridSegmentOrientation
```
```cpp
public enum class RectangularGridSegmentOrientation
```
```fsharp
type RectangularGridSegmentOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 1 | A horizontal GridSegment |
| Vertical | 0 | A vertical GridSegment |

#### Reference

Autodesk.Revit.DB Namespace